; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 883125 2 2 3 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph2 - mode
	infrared0 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation0 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Star1)
	(have_image Star4 infrared0)
	(have_image Star5 thermograph2)
	(have_image Star6 infrared0)
	(have_image Phenomenon7 thermograph1)
))

)

; plan
1. (turn_to satellite1 star1 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star1)
   goals met: 1 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
3. (turn_to satellite0 groundstation0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 6
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 6
5. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 6
6. (turn_to satellite1 groundstation0 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 6
7. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   goals met: 0 of 6
8. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 6
9. (turn_to satellite1 star5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star5)
   goals met: 0 of 6
10. (take_image satellite0 star6 instrument0 infrared0)
   added: (have_image star6 infrared0)
   goals met: 1 of 6
11. (turn_to satellite0 star4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star4)
   goals met: 1 of 6
12. (take_image satellite1 star5 instrument1 thermograph2)
   added: (have_image star5 thermograph2)
   goals met: 2 of 6
13. (turn_to satellite1 star1 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star1)
   goals met: 3 of 6
14. (take_image satellite0 star4 instrument0 infrared0)
   added: (have_image star4 infrared0)
   goals met: 4 of 6
15. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   goals met: 5 of 6
16. (turn_to satellite1 phenomenon7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 6
17. (take_image satellite1 phenomenon7 instrument1 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 5 of 6
18. (turn_to satellite1 star1 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star1)
   goals met: 6 of 6
